In [2]:
import numpy as np
import pandas as pd

In [3]:
l1=[2,4,6,7]
pd.DataFrame(l1)

   0
0  2
1  4
2  6
3  7

In [4]:
l1=[2,4,6,7]
pd.DataFrame([l1])

   0  1  2  3
0  2  4  6  7

In [5]:
l1=[2,4,7],[4,7,9]
pd.DataFrame(l1)

   0  1  2
0  2  4  7
1  4  7  9

In [6]:
l1=[[2,4,7],[4,7,9]]
pd.DataFrame(l1)

   0  1  2
0  2  4  7
1  4  7  9

In [7]:
arr=np.arange(10).reshape(2,5)
display(arr)
display(pd.DataFrame(arr))

array([[0, 1, 2, 3, 4],
       [5, 6, 7, 8, 9]])

   0  1  2  3  4
0  0  1  2  3  4
1  5  6  7  8  9

In [8]:
# dict1={'Name':['Talha','Ali'],'RollNumber':[3,6]}
# display(pd.DataFrame(dict1))
# display(pd.DataFrame({'Name':['Talha','Joiya'],'RollNum':[2,7]}))

Problem 3

Convert the series ser into a dataframe with its index as another column on the dataframe.

In [9]:
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))
ser = pd.Series(mydict)
ser

a     0
b     1
c     2
e     3
d     4
f     5
g     6
h     7
i     8
j     9
k    10
l    11
m    12
n    13
o    14
p    15
q    16
r    17
s    18
t    19
u    20
v    21
w    22
x    23
y    24
z    25
dtype: int32

Problem 4

Combine ser1 and ser2 to form a dataframe.

In [10]:
ser1 = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))
ser2 = pd.Series(np.arange(26))

In [11]:
pd.DataFrame({'ser1':ser1,'ser2':ser2})

   ser1  ser2
0     a     0
1     b     1
2     c     2
3     e     3
4     d     4
5     f     5
6     g     6
7     h     7
8     i     8
9     j     9
10    k    10
11    l    11
12    m    12
13    n    13
14    o    14
15    p    15
16    q    16
17    r    17
18    s    18
19    t    19
20    u    20
21    v    21
22    w    22
23    x    23
24    y    24
25    z    25

Problem 5

Get all items of ser1 and ser2 not common to both.

Input

```
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])
```

In [12]:
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])

Problem 1

How to import pandas and check the version?

Problem 2

Create a pandas series from each of the items below: a list, numpy and a dictionary
    
Problem 3

Convert the series ser into a dataframe with its index as another column on the dataframe.

Problem 4

Combine ser1 and ser2 to form a dataframe.

Problem 5

Get all items of ser1 and ser2 not common to both.

Problem 6

Compute the minimum, 25th percentile, median, 75th, and maximum of ser.

Problem 7

Calculte the frequency counts of each unique value ser.

Problem 8

From ser, keep the top 2 most frequent items as it is and replace everything else as ‘Other’.

Problem 9

Bin the series ser into 10 equal deciles and replace the values with the bin name.

Problem 10

Reshape the series ser into a dataframe with 7 rows and 5 columns

Problem 11 

Find the positions of numbers that are multiples of 3 from ser.

Problem 12

Stack ser1 and ser2 vertically and horizontally (to form a dataframe).

Problem 13

Stack ser1 and ser2 vertically and horizontally (to form a dataframe).

Problem 14


Get the day of month, week number, day of year and day of week from ser.

Problem 15

From ser, extract words that contain atleast 2 vowels.

Problem 16


Check if df has any missing values.

Problem 17

Count the number of missing values in each column of df. Which column has the maximum number of missing values?

Problem 18

Replace missing values in Min.Price and Max.Price columns with their respective mean.

Problem 19

In df, use apply method to replace the missing values in Min.Price with the column’s mean and those in Max.Price with the column’s median.

Problem 20

Get the first column (a) in df as a dataframe (rather than as a Series).

Problem 21

1 - In df, interchange columns 'a' and 'c'.

2 - Create a generic function to interchange two columns, without hardcoding column names.

3 - Sort the columns in reverse alphabetical order, that is colume 'e' first through column 'a' last.

Problem 22

From df, filter the 'Manufacturer', 'Model' and 'Type' for every 20th row starting from 1st (row 0).

Problem 23 

Find the row position of the 5th largest value of column 'a' in df.

Problem 24 

In ser, find the position of the 2nd largest value greater than the mean.

Problem 25


Get one-hot encodings for column 'a' in the dataframe df and append it as columns.

# lets start

Problem 2

Create a pandas series from each of the items below: a list, numpy and a dictionary

In [19]:
a=pd.Series([2,3,5])
display(a)
b=pd.Series(np.array([3,5,6,7]))
display(b)
c=pd.Series({2:'s',3:'e',4:'w'})
display(c)

0    2
1    3
2    5
dtype: int64

0    3
1    5
2    6
3    7
dtype: int32

2    s
3    e
4    w
dtype: object

In [20]:
import numpy as np
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))

In [26]:
display(pd.Series(mylist))

0     a
1     b
2     c
3     e
4     d
5     f
6     g
7     h
8     i
9     j
10    k
11    l
12    m
13    n
14    o
15    p
16    q
17    r
18    s
19    t
20    u
21    v
22    w
23    x
24    y
25    z
dtype: object

In [27]:
display(pd.Series(myarr))

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
12    12
13    13
14    14
15    15
16    16
17    17
18    18
19    19
20    20
21    21
22    22
23    23
24    24
25    25
dtype: int32

In [29]:
display(pd.Series(mydict))

a     0
b     1
c     2
e     3
d     4
f     5
g     6
h     7
i     8
j     9
k    10
l    11
m    12
n    13
o    14
p    15
q    16
r    17
s    18
t    19
u    20
v    21
w    22
x    23
y    24
z    25
dtype: int32

Problem 3

Convert the series ser into a dataframe with its index as another column on the dataframe.

In [41]:
a=pd.Series(np.array([2,5,8,'Joiya']),index=['a','b','c','d'])
display(a)
display(a.index.values)
display(a.values)
df=pd.DataFrame([a],columns=a.index.values)
df

a        2
b        5
c        8
d    Joiya
dtype: object

array(['a', 'b', 'c', 'd'], dtype=object)

array(['2', '5', '8', 'Joiya'], dtype=object)

   a  b  c      d
0  2  5  8  Joiya

Problem 4

Combine ser1 and ser2 to form a dataframe.

In [43]:
a=pd.Series(np.arange(5))
b=pd.Series(np.array([2,1,7,9,0]))
display(pd.DataFrame({'a':a,'b':b}))

   a  b
0  0  2
1  1  1
2  2  7
3  3  9
4  4  0

Problem 5

Get all items of ser1 and ser2 not common to both.

In [102]:
# a=pd.Series([3,2,1,8,9],index=[1,2,5,6,7],name='Ta')
# b=pd.Series([3,3,0,6,1],index=[1,2,5,9,0],name='Jo')
# aa=pd.concat([a,b],axis=1)
# bb=pd.concat([a,b])
# display(aa)
# display(bb)
# display(type(a))
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])
ser1[~ser1.isin(ser2)].append(ser2[~ser2.isin(ser1)])

C:\Users\mtalh\AppData\Local\Temp\ipykernel_2136\2203003598.py:10: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  ser1[~ser1.isin(ser2)].append(ser2[~ser2.isin(ser1)])

0    1
1    2
2    3
2    6
3    7
4    8
dtype: int64